config/doom/config.org
#+TITLE: Config.el
#+AUTHOR: Jonathan Peel
#+STARTUP: overview

* General settings

- Setting user name and email address
#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Jonathan Peel"
      user-mail-address "me@jonathanpeel.co.za")
#+end_src

** PATH/ENV

#+begin_src emacs-lisp :tangle yes
(setenv "PATH" (concat (getenv "PATH") ":/home/me/.local/bin"))
#+end_src


* Font settings

- Setting up the primary font and a non-monospace font
#+begin_src emacs-lisp :tangle yes
(setq
      doom-font (font-spec :family "Komiki Mono" :size 16 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Noto Sans" :size 16)
      doom-serif-font (font-spec :family "Noto Serif")
      doom-unicode-font (font-spec :family "Noto Serif" :size 16)
      doom-big-font (font-spec :family "Komiki Mono" :size 21))
#+end_src

- Use UTF 8

 #+begin_src emacs-lisp :tangle yes
(prefer-coding-system       'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)
 #+end_src


* Visual settings

** Theme

#+begin_src emacs-lisp :tangle yes
;;(setq doom-theme 'doom-old-hope)
#+end_src

*** Automatic Theme Switching
Based on GTK theme

#+begin_src emacs-lisp :tangle yes
(defun my/system-dark-mode-p ()
  (string-match-p
   "dark"
   (shell-command-to-string
    "gsettings get org.gnome.desktop.interface color-scheme")))

(defun my/apply-theme ()
  (if (my/system-dark-mode-p)
      (load-theme 'doom-monokai-ristretto t)
      (load-theme 'doom-flatwhite t)))

;; Run when emacs starts
(my/apply-theme)

;; Set up a timer to check periodically
(run-with-timer 0 5 #'my/apply-theme)
#+end_src

#+RESULTS:
: [nil 26485 4563 684996 5 my/apply-theme nil nil 177000 nil]

** Org Block Faces

#+begin_src emacs-lisp :tangle yes
(add-hook! 'org-mode-hook
  (setq org-src-block-faces
        (append org-src-block-faces
                '(("plantuml" modus-themes-nuanced-yellow)
                  ("json" modus-themes-nuanced-yellow)
                  ("fsharp" modus-themes-nuanced-blue)
                  ("csharp" modus-themes-nuanced-magenta)))))
#+end_src


** Fill Column
#+begin_src emacs-lisp :tangle yes
;; Set maximum line width to 120 characters
(setq visual-fill-column-width 120
      visual-fill-column-center-text t)
(visual-fill-column-mode 1)
(add-hook! 'org-mode-hook
  (visual-fill-column-mode 1))

#+end_src


** Full Screen

 #+begin_src emacs-lisp :tangle no
(add-to-list 'default-frame-alist '(fullscreen . maximized))
 #+end_src


* Line numbers

- Setting the style of line numbers
#+begin_src emacs-lisp :tangle yes
(setq display-line-numbers-type t)
#+end_src


* Org mode

** Setting the directory for org files
#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/OneDrive/org/")
#+end_src

** Start with indentation
#+begin_src emacs-lisp :tangle yes
(setq org-startup-indented t
      org-src-tab-acts-natively t)
#+end_src

** Use visual pitch mode
#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook
          (lambda ()
            (variable-pitch-mode 1)
            visual-line-mode))
#+end_src

** Pretty signals
#+begin_src emacs-lisp :tangle yes
(setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "†")
                                       ("#+END_SRC" . "†")
                                       ("#+begin_src" . "†")
                                       ("#+end_src" . "†")
                                       (">=" . "≥")
                                       ("=>" . "⇨")))
(setq prettify-symbols-unprettify-at-point 'right-edge)
(add-hook 'org-mode-hook 'prettify-symbols-mode)
#+end_src

** Fixed pitch font in src blocks
#+begin_src emacs-lisp :tangle yes
(custom-theme-set-faces
 'user
 '(org-block                 ((t (:inherit fixed-pitch))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-property-value        ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-tag                   ((t (:inherit (shadow fixed-pitch) :weight bold))))
 '(org-verbatim              ((t (:inherit (shadow fixed-pitch))))))
#+end_src

** Number org headers
#+begin_src emacs-lisp :tangle yes
;(use-package org-num
;  :load-path "lisp/"
;  :after org
;  :hook (org-mode . org-num-mode))
#+end_src

** Org Agenda

#+begin_src emacs-lisp :tangle yes
(setq org-agenda-files
      (seq-filter (lambda (file)
                   (and (string-match "\\.org$" file)
                       (not (string-match "archive" file))
                       (not (string-match "index-old" file))
                       (not (string-match "tmp" file))))
                 (directory-files-recursively org-directory "\\.")))
#+end_src

** Org habit

#+begin_src emacs-lisp :tangle yes
(use-package! org-habit
  :after org
  :config
  (setq org-habit-following-days 7
        org-habit-preceding-days 35
        org-habit-show-habits t))
#+end_src

** Org header bullets

#+begin_src emacs-lisp :tangle yes
(setq org-superstar-headline-bullets-list '("⁖" "◉" "○" "✸" "✿"))
#+end_src

** Org Pretty Tag :TOPIC:CLR:

#+begin_src emacs-lisp :tangle yes
(use-package org-pretty-tags
  :demand t
  :config
   (setq org-pretty-tags-surrogate-strings
         (quote
          (("TOPIC" . "☆")
           ("russian" . "🇷🇺")

           ("CLR"   . "☀")
           ("DZ"    . "🌦")
           ("RA"    . "🌧")
           ("TS"    . "⛈")
           ("TSRA"  . "⛈")
           ("SN"    . "🌨")
           ("SCT"   . "🌤")
           ("BKN"   . "🌤")
           ("OVC"   . "☁")


           ("@work"    . "⚒")
           ("@study"   . "📚")
           ("birthday" . "🎂")
           ("rain"     . "🌧")
           ("time"     . "⌚")
           ("grat"     . "🤗")
           ("lena"     . "👩‍❤️‍👩")
           ("fp"       . "🤦🏻‍♂️")
           ("train"    . "🚆")
           ("mountain" . "⛰️")

           ("security" . "🔥"))))
   (org-pretty-tags-global-mode))
#+end_src

#+RESULTS:
: t

** Org Roam

*** Daily template

#+begin_src emacs-lisp :tangle yes
(after! org-roam
  (setq org-roam-dailies-capture-templates
      '(("j" "Journal" entry "\n\n* Entry - %<%H:%M> \n%U\n\n%?"
         :target (file+datetree "daily.org" "#+TITLE: Journal\n"))

        ("g" "Goals" entry "* [ ] Goals - %<%d %B %Y> [/]\nSCHEDULED: %t\n** [ ] %?"
         :target (file+datetree "daily.org" "#+TITLE: Journal\n"))

                )))
#+end_src

** Org Capture

#+begin_src emacs-lisp :tangle yes
(setq org-capture-templates
      '(
        ;; ("j" "Journal")
        ;; ("jj" "journal" entry (file+datetree "~/OneDrive/org/journal.org")
        ;;  "\n\n* %U\n%?")
        ;; ("jt" "journal" entry (file+datetree "~/OneDrive/org/journal.org")
        ;;  "* [ ] %?\nSCHEDULED: %t")

        ("j" "Journal")
        ("jj" "Journal" entry
         (file+olp+datetree "journal.org" "Journal")
         "* Entry - %<%H:%M>\n%U\n\n%?"
         :empty-lines 1)
        ("jg" "Goals" entry
         (file+olp+datetree "journal.org" "Journal")
         "* TODO Goals - %<%d %B %Y> [/]\nSCHEDULED: %t\n** [ ] %?"
         :prepend t)

        ("b" "blog-post" entry (file+olp "~/repos/blog-home/blog.org" "blog")
         "* TODO %^{Title} %^g \n:PROPERTIES:\n:EXPORT_FILE_NAME: %^{Slug}\n:EXPORT_DATE: %T\n:END:\n\n%?"
         :empty-lines-before 2)

        ("m" "Email Workflow")
        ("mf" "Follow Up" entry (file+olp "~/OneDrive/org/mail.org" "Follow Up")
         "* TODO Follow up with %:fromname on %a\nSCHEDULED:%t\n\n%i")
        ("mr" "Read Later" entry (file+olp "~/OneDrive/org/mail.org" "Read Later")
         "* TODO Read %a\nSCHEDULED:%t\n\n%i")

      ("s" "Sleep Entry" table-line
         (file+headline "sleep.org" "Data")
         "|#|%^{Date}u|%^{Move (kcal)}|%^{Exercise (min)}|%^{Caffeine (mg)}|%^{Tim in daylight (min)}|%^{Time in bed}|%^{Time out of bed}|%^{Sleep Duration (h:mm)}||%^{Tags}g|"
         :immediate-finish t :jump-to-captured t
         )

        ("t" "Task" entry
         (file+headline "tasks.org" "Tasks")
         "** TODO %? %^g\n:PROPERTIES:\n:CREATED: %U\n:END:\n" :empty-lines 1)

        ("T" "Task with Deadline" entry
         (file+headline "tasks.org" "Tasks")
         "** TODO %?  %^g\nDEADLINE: %^t\n:PROPERTIES:\n:CREATED: %U\n:END:\n" :empty-lines 1)

        ))
#+end_src

#+RESULTS:
| j  | Journal |       |                                         |                    |
| jj | Journal | entry | (file+olp+datetree journal.org Journal) | * Entry - %<%H:%M> |



* RSS (elfeed)

#+begin_src emacs-lisp :tangle yes
(add-hook! 'elfeed-search-mode-hook #'elfeed-update)
(add-hook! 'elfeed-search-mode-hook (elfeed-search-set-filter "+unread"))
(after! elfeed
  (setq elfeed-show-entry-switch 'display-buffer)
  (setq elfeed-search-remain-on-entry t))
#+end_src


* Email (MU4E)
** MU Initialisation

mu needs to be initilised with the following two commands from the terminal:

mu init --maildir=~/.mail \
    --my-address=me@jonathanpeel.co.za \
    --my-address=jonathanp@polymorphic.group \
    --my-address=jonathanp@commstack.co.uk

mu index

** basic MU4E settings

#+begin_src emacs-lisp :tangle yes
(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e/")
#+end_src

#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq mu4e-update-interval (* 5 60)))        ;; update every 5 minutes
#+end_src

This is set to ~t~ to avoid mail syncing issues when using mbsync.
#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq mu4e-change-filenames-when-moving t))
#+end_src

Delete sent messages (to not keep drafts)
#+begin_src emacs-lisp :tangle yes
(setq mu4e-sent-messages-behavior 'delete)
#+end_src

