config/doom/config.el
(setq user-full-name "Jonathan Peel"
      user-mail-address "me@jonathanpeel.co.za")

(setenv "PATH" (concat (getenv "PATH") ":/home/me/.local/bin"))

(setq
      doom-font (font-spec :family "Komiki Mono" :size 16 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Noto Sans" :size 16)
      doom-serif-font (font-spec :family "Noto Serif")
      doom-unicode-font (font-spec :family "Noto Serif" :size 16)
      doom-big-font (font-spec :family "Komiki Mono" :size 21))

(prefer-coding-system       'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(setq default-buffer-file-coding-system 'utf-8)

;;(setq doom-theme 'doom-old-hope)

(defun my/system-dark-mode-p ()
  (string-match-p
   "dark"
   (shell-command-to-string
    "gsettings get org.gnome.desktop.interface color-scheme")))

(defun my/apply-theme ()
  (if (my/system-dark-mode-p)
      (load-theme 'doom-monokai-ristretto t)
      (load-theme 'doom-flatwhite t)))

;; Run when emacs starts
(my/apply-theme)

;; Set up a timer to check periodically
(run-with-timer 0 5 #'my/apply-theme)

(add-hook! 'org-mode-hook
  (setq org-src-block-faces
        (append org-src-block-faces
                '(("plantuml" modus-themes-nuanced-yellow)
                  ("json" modus-themes-nuanced-yellow)
                  ("fsharp" modus-themes-nuanced-blue)
                  ("csharp" modus-themes-nuanced-magenta)))))

;; Set maximum line width to 120 characters
(setq visual-fill-column-width 120
      visual-fill-column-center-text t)
(visual-fill-column-mode 1)
(add-hook! 'org-mode-hook
  (visual-fill-column-mode 1))

(setq display-line-numbers-type t)

(setq org-directory "~/OneDrive/org/")

(setq org-startup-indented t
      org-src-tab-acts-natively t)

(setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "†")
                                       ("#+END_SRC" . "†")
                                       ("#+begin_src" . "†")
                                       ("#+end_src" . "†")
                                       (">=" . "≥")
                                       ("=>" . "⇨")))
(setq prettify-symbols-unprettify-at-point 'right-edge)
(add-hook 'org-mode-hook 'prettify-symbols-mode)

(custom-theme-set-faces
 'user
 '(org-block                 ((t (:inherit fixed-pitch))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-property-value        ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-tag                   ((t (:inherit (shadow fixed-pitch) :weight bold))))
 '(org-verbatim              ((t (:inherit (shadow fixed-pitch))))))

;(use-package org-num
;  :load-path "lisp/"
;  :after org
;  :hook (org-mode . org-num-mode))

(setq org-agenda-files
      (seq-filter (lambda (file)
                   (and (string-match "\\.org$" file)
                       (not (string-match "archive" file))
                       (not (string-match "index-old" file))
                       (not (string-match "tmp" file))))
                 (directory-files-recursively org-directory "\\.")))

(use-package! org-habit
  :after org
  :config
  (setq org-habit-following-days 7
        org-habit-preceding-days 35
        org-habit-show-habits t))

(setq org-superstar-headline-bullets-list '("⁖" "◉" "○" "✸" "✿"))

(use-package org-pretty-tags
  :demand t
  :config
   (setq org-pretty-tags-surrogate-strings
         (quote
          (("TOPIC" . "☆")
           ("russian" . "🇷🇺")

           ("CLR"   . "☀")
           ("DZ"    . "🌦")
           ("RA"    . "🌧")
           ("TS"    . "⛈")
           ("TSRA"  . "⛈")
           ("SN"    . "🌨")
           ("SCT"   . "🌤")
           ("BKN"   . "🌤")
           ("OVC"   . "☁")


           ("@work"    . "⚒")
           ("@study"   . "📚")
           ("birthday" . "🎂")
           ("rain"     . "🌧")
           ("time"     . "⌚")
           ("grat"     . "🤗")
           ("lena"     . "👩‍❤️‍👩")
           ("fp"       . "🤦🏻‍♂️")
           ("train"    . "🚆")
           ("mountain" . "⛰️")

           ("security" . "🔥"))))
   (org-pretty-tags-global-mode))

(after! org-roam
  (setq org-roam-dailies-capture-templates
      '(("j" "Journal" entry "\n\n* Entry - %<%H:%M> \n%U\n\n%?"
         :target (file+datetree "daily.org" "#+TITLE: Journal\n"))

        ("g" "Goals" entry "* [ ] Goals - %<%d %B %Y> [/]\nSCHEDULED: %t\n** [ ] %?"
         :target (file+datetree "daily.org" "#+TITLE: Journal\n"))

                )))

(setq org-capture-templates
      '(
        ;; ("j" "Journal")
        ;; ("jj" "journal" entry (file+datetree "~/OneDrive/org/journal.org")
        ;;  "\n\n* %U\n%?")
        ;; ("jt" "journal" entry (file+datetree "~/OneDrive/org/journal.org")
        ;;  "* [ ] %?\nSCHEDULED: %t")


        ("b" "blog-post" entry (file+olp "~/repos/blog-home/blog.org" "blog")
         "* TODO %^{Title} %^g \n:PROPERTIES:\n:EXPORT_FILE_NAME: %^{Slug}\n:EXPORT_DATE: %T\n:END:\n\n%?"
         :empty-lines-before 2)

        ("m" "Email Workflow")
        ("mf" "Follow Up" entry (file+olp "~/OneDrive/org/mail.org" "Follow Up")
         "* TODO Follow up with %:fromname on %a\nSCHEDULED:%t\n\n%i")
        ("mr" "Read Later" entry (file+olp "~/OneDrive/org/mail.org" "Read Later")
         "* TODO Read %a\nSCHEDULED:%t\n\n%i")

      ("s" "Sleep Entry" table-line
         (file+headline "sleep.org" "Data")
         "|#|%^{Date}u|%^{Move (kcal)}|%^{Exercise (min)}|%^{Caffeine (mg)}|%^{Tim in daylight (min)}|%^{Time in bed}|%^{Time out of bed}|%^{Sleep Duration (h:mm)}||%^{Tags}g|"
         :immediate-finish t :jump-to-captured t
         )))

(add-hook! 'elfeed-search-mode-hook #'elfeed-update)
(add-hook! 'elfeed-search-mode-hook (elfeed-search-set-filter "+unread"))
(after! elfeed
  (setq elfeed-show-entry-switch 'display-buffer)
  (setq elfeed-search-remain-on-entry t))

(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e/")

(setq
  mu4e-get-mail-command "mbsync -a"    ;; or fetchmail, or ...
  mu4e-update-interval (* 5 60))        ;; update every 5 minutes

(setq mu4e-change-filenames-when-moving t)
