config/doom/config.org
** Mail and Folders

#+begin_src emacs-lisp :tangle yes
(setq mu4e-maildir "~/.mail")
(setq mu4e-root-maildir "~/.mail")
#+end_src

** MU4E Contexts
*** Polymorphic

#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq my-mu4e-context-poly
        (make-mu4e-context
         :name "Polymorphic"
         :enter-func (lambda () (mu4e-message "Enter Polymorphic context"))
         :leave-func (lambda () (mu4e-message "Leave Polymorphic context"))
         :match-func (lambda (msg) (when msg (string-prefix-p "/poly" (mu4e-message-field msg :maildir))))
         :vars '((mu4e-sent-folder       . "/poly/Sent")
                 (mu4e-drafts-folder     . "/poly/Drafts")
                 (mu4e-trash-folder      . "/poly/Trash")
                 (mu4e-refile-folder     . "/poly/Archive")
                 (mu4e-get-mail-command  . "mbsync polymorphic")
                 (smtpmail-smtp-user     . "jonathanp@polymorphic.group")
                 (user-mail-address      . "jonathanp@polymorphic.group")
                 (user-full-name         . "Jonathan Peel")
                 (mu4e-bookmarks         .
                        ((:name "INBOX (Polymorphic)" :query "maildir:/poly/INBOX" :key ?i)
                         (:name "Unread messages"
                          :query "maildir:/poly/* AND flag:unread AND NOT flag:trashed" :key 117)
                         (:name "Today's messages"
                          :query "maildir:/poly/* AND date:today..now" :key 116)
                         (:name "Last 7 days"
                          :query "maildir:/poly/* AND date:7d..now" :hide-unread t :key 119)
                         (:name "Messages with images"
                          :query "maildir:/poly/* AND mime:image/*" :key 112)))
                 (mu4e-compose-signature . "")))))
#+end_src

*** CommStack

#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq my-mu4e-context-comm
        (make-mu4e-context
         :name "CommStack"
         :enter-func (lambda () (mu4e-message "Enter jonathanp@commstack.co.uk context"))
         :leave-func (lambda () (mu4e-message "Leave jonathanp@commstack.co.uk context"))
         :match-func (lambda (msg) (when msg (string-prefix-p "/comm" (mu4e-message-field msg :maildir))))
         :vars '((mu4e-sent-folder       . "/comm/Sent")
                 (mu4e-drafts-folder     . "/comm/Drafts")
                 (mu4e-trash-folder      . "/comm/Trash")
                 (mu4e-refile-folder     . "/comm/Archive")
                 (mu4e-get-mail-command  . "mbsync commstack")
                 (smtpmail-smtp-user     . "jonathanp@commstack.co.uk")
                 (user-mail-address      . "jonathanp@commstack.co.uk")
                 (user-full-name         . "Jonathan Peel")
                 (mu4e-bookmarks         .
                        ((:name "INBOX (CommStack)" :query "maildir:/comm/INBOX" :key ?i)
                         (:name "Unread messages"
                          :query "maildir:/comm/* AND flag:unread AND NOT flag:trashed" :key 117)
                         (:name "Today's messages"
                          :query "maildir:/comm/* AND date:today..now" :key 116)
                         (:name "Last 7 days"
                          :query "maildir:/comm/* AND date:7d..now" :hide-unread t :key 119)
                         (:name "Messages with images"
                          :query "maildir:/comm/* AND mime:image/*" :key 112)))
                 (mu4e-compose-signature . "")))))
#+end_src

*** Jonathan Peel

#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq my-mu4e-context-jp
        (make-mu4e-context
         :name "Jonathan Peel"
         :enter-func (lambda () (mu4e-message "Enter me@jonathanpeel.co.za context"))
         :leave-func (lambda () (mu4e-message "Leave me@jonathanpeel.co.za context"))
         :match-func (lambda (msg) (when msg (string-prefix-p "/comm" (mu4e-message-field msg :maildir))))
         :vars '((mu4e-sent-folder       . "/jp/[Gmail]/Sent Mail")
                 (mu4e-drafts-folder     . "/jp/[Gmail]/Drafts")
                 (mu4e-trash-folder      . "/jp/[Gmail]/Bin")
                 (mu4e-refile-folder     . "/jp/[Gmail]/All Mail")
                 (mu4e-get-mail-command  . "mbsync jonathanpeel")
                 (smtpmail-smtp-user     . "me@jonathanpeel.co.za")
                 (user-mail-address      . "me@jonathanpeel.co.za")
                 (user-full-name         . "Jonathan Peel")
                 (mu4e-bookmarks         .
                        ((:name "INBOX" :query "maildir:/jp/INBOX" :key ?i)
                         (:name "Unread messages"
                          :query "maildir:/jp/* AND flag:unread AND NOT flag:trashed" :key 117)
                         (:name "Today's messages"
                          :query "maildir:/jp/* AND date:today..now" :key 116)
                         (:name "Last 7 days"
                          :query "maildir:/jp/* AND date:7d..now" :hide-unread t :key 119)
                         (:name "Messages with images"
                          :query "maildir:/jp/* AND mime:image/*" :key 112)))
                 (mu4e-compose-signature . "")))))
#+end_src

*** MU4E Context List

#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq mu4e-contexts (list my-mu4e-context-poly
                            my-mu4e-context-comm
                            my-mu4e-context-jp)))
#+end_src

** Dashboard

#+begin_src emacs-lisp :tangle yes
(setq mu4e-maildir-shortcuts
  '((:maildir "/comm/Inbox" :key ?c :name "CommStack")
    (:maildir "/poly/Inbox" :key ?p :name "Polymorphic")
    (:maildir "/jp/Inbox" :key ?j :name "Jonathan")))
#+end_src

#+begin_src emacs-lisp :tangle yes
;(define-key mu4e-main-mode-map (kbd "U")
;  (lambda ()
;    (interactive)
;    (message "Syncing mail...")
;    (let ((process (async-shell-command "mbsync -aV")))
;      (set-process-sentinel
;       process
;       (lambda (proc event)
;         (when (string= event "finished\n")
;           (if (= 0 (process-exit-status proc))
;               (progn
;                 (kill-buffer (process-buffer proc))
;                 (delete-window (get-buffer-window (process-buffer proc)))
;                 (message "Mail sync completed successfully"))
;             (message "Mail sync finished with errors"))))))))
#+end_src

** SMTP

Use ~msmtp~ instead of the built in Emacs SMTP cliet.

#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq sendmail-program (executable-find "msmtp")
	send-mail-function #'smtpmail-send-it
	message-sendmail-f-is-evil t
	message-sendmail-extra-arguments '("--read-envelope-from")
	message-send-mail-function #'message-send-mail-with-sendmail))
#+end_src

* Calendar

** Calendar Settigs

#+begin_src emacs-lisp :tangle yes
;(after! org-gcal
;  (setq org-gcal-client-id "jonathanp@polymorphic.group"
;        org-gcal-client-secret "your-client-secret"
;        org-gcal-fetch-file-alist '(("jonathanp@polymorphic.group" . "~/OneDrive/org/calendar.org"))))
#+end_src

** Configure caldav sync
#+begin_src emacs-lisp :tangle yes
;(use-package! org-caldav
;  :config
;  (setq org-caldav-url "http://localhost:1080/users/jonathanp@polymorphic.group/calendar"
;        org-caldav-calendar-id "Calendar"
;        org-caldav-inbox "~/OneDrive/org/calendar.org"
;        org-caldav-files '("~/OneDrive/org/calendar.org")
;        org-caldav-sync-direction 'twoway
;        org-caldav-delete-calendar-entries 'ask
;        org-caldav-resume-aborted-sync t))
#+end_src


* Transparency

** Setting up transparency for frames
#+begin_src emacs-lisp :tangle no
  (set-frame-parameter (selected-frame) 'alpha '(90 . 75))
  (add-to-list 'default-frame-alist '(alpha . (90 . 75)))
#+end_src




* PlantUML

- Setting up the PlantUML jar path and the execution mode
#+begin_src emacs-lisp :tangle yes
  (setq org-plantuml-jar-path "/home/me/bin/plantuml.jar")
  (setq org-plantuml-default-exec-mode 'executable)
  (setq plantuml-default-exec-mode 'executable)
#+end_src


* LaTeX

