config/doom/config.org
** Quote blocks

export a quote block as ~\begin{fancyquotes}~

#+begin_src emacs-lisp :tangle yes
(defun org-latex-quote-block (quote-block contents info)
  "Transcode a QUOTE-BLOCK element from Org to LaTeX.
    CONTENTS holds the contents of the block.  INFO is a plist
    holding contextual information."
  (org-latex--wrap-label
   quote-block
   (format "\\begin{shaded*}\\begin{quote}\n%s\\end{quote}\\end{shaded*}" contents) info))

;(org-export-define-derived-backend 'my-latex 'latex
;  :translate-alist '((quote-block . my-org-latex-quote-block)))
#+end_src




**  Setting up the LaTeX package for code highlighting
#+begin_src emacs-lisp :tangle yes
  (setq org-latex-listings 'minted)
  (setq org-latex-packages-alist '(("" "minted")))
  (setq org-latex-pdf-process
        '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  (setq org-latex-minted-options
        '(("frame" "leftline")
          ("framesep" "2mm")))
#+end_src


* OTH


* ESS (R)

#+begin_src emacs-lisp :tangle yes
(after! ess
  (setq ess-style 'RStudio
        ess-eval-visibly 'nowait
        ess-use-flymake nil)  ; Use flycheck instead

  ;; Enable rainbow delimiters in R scripts
  (add-hook! 'ess-r-mode-hook #'rainbow-delimiters-mode)

  ;; Enable line numbers in R scripts
  (add-hook! 'ess-r-mode-hook #'display-line-numbers-mode)

  ;; Auto-completion settings
  (setq ess-use-company t
        company-R-args t
        company-R-objects t))
#+end_src


* LSP

Custom language server modes

#+begin_src emacs-lisp :tangle yes
(after! lsp-mode
  (setq lsp-r-server-path "R"
        lsp-r-lsp-server 'languageserver))
#+end_src

** astro-mode
#+begin_src emacs-lisp :tangle yes
(define-derived-mode astro-mode web-mode "astro")
(setq auto-mode-alist
      (append '((".*\\.astro\\'" . astro-mode))
              auto-mode-alist))

(with-eval-after-load 'lsp-mode
  (add-to-list 'lsp-language-id-configuration
               '(astro-mode . "astro"))

  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("astro-ls" "--stdio"))
                    :activation-fn (lsp-activate-on "astro")
                    :server-id 'astro-ls)))
#+end_src


* Typescript

#+begin_src emacs-lisp :tangle yes
(after! org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((typescript . t))))

;(use-package! ob-typescript
;  :after org
;  :config
;  ;; Use tsx instead of ts-node
;  (setq org-babel-typescript-command "tsx"))
#+end_src


* .Net
#+begin_src emacs-lisp :tangle yes
(org-babel-do-load-languages 'org-babel-load-languages '((csharp . t)))
#+end_src

** F#

#+begin_src emacs-lisp :tangle yes
(after! fsharp-mode
  (setq fsharp-ac-use-popup nil)  ; Use display-buffer instead of pop-up
  (setq lsp-fsharp-server-runtime 'net-core)  ; Use .NET Core runtime

  ;; Optional: Configure formatting
  (setq-hook! 'fsharp-mode-hook
    tab-width 4
    indent-tabs-mode nil))

;; Optional: Add key bindings
(map! :map fsharp-mode-map
      :localleader
      "b" #'fsharp-load-buffer-file    ; Load current buffer
      "e" #'fsharp-eval-region         ; Evaluate region
      "i" #'fsharp-ac-load-project     ; Load project
      "p" #'fsharp-ac-start-process)   ; Start F# process
#+end_src


* Snippets

#+begin_src emacs-lisp :tangle yes
(after! yasnippet
  (setq yas-snippet-dirs '("~/.doom.d/snippets")))
#+end_src


* Prolog

Enable prolog for .pl files

#+begin_src emacs-lisp :tangle yes
(add-to-list 'auto-mode-alist '("\\.pl$" . prolog-mode))
(setq prolog-electric-if-then-else-flag t)

; Org-Babel Support
(setq org-babel-prolog-command "swipl")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((prolog . t)))
#+end_src


* COMMENT Emacs Application Framework

#+begin_src emacs-lisp :tangle no
(add-to-list 'load-path "~/.emacs.d/site-lisp/emacs-application-framework/")
(require 'eaf)
(require 'eaf-markmap)
(require 'eaf-browser)
(require 'eaf-airshare)
(require 'eaf-org-previewer)
(require 'eaf-rss-reader)
(require 'eaf-camera)
; (require 'eaf-vue-tailwindcss)
(require 'eaf-image-viewer)
(require 'eaf-markdown-previewer)
(require 'eaf-file-browser)
(require 'eaf-video-player)
(require 'eaf-mindmap)
(require 'eaf-git)
(require 'eaf-file-manager)
(require 'eaf-demo)
(require 'eaf-system-monitor)
(require 'eaf-2048)
(require 'eaf-pdf-viewer)
; (require 'eaf-jupyter)
(require 'eaf-terminal)
(require 'eaf-music-player)
; (require 'eaf-netease-cloud-music)
; (require 'eaf-vue-demo)
(require 'eaf-file-sender)
(require 'eaf-map)
#+end_src
