config/doom/config.el

(defun org-latex-quote-block (quote-block contents info)
  "Transcode a QUOTE-BLOCK element from Org to LaTeX.
    CONTENTS holds the contents of the block.  INFO is a plist
    holding contextual information."
  (org-latex--wrap-label
   quote-block
   (format "\\begin{shaded*}\\begin{quote}\n%s\\end{quote}\\end{shaded*}" contents) info))

;(org-export-define-derived-backend 'my-latex 'latex
;  :translate-alist '((quote-block . my-org-latex-quote-block)))

(setq org-latex-listings 'minted)
(setq org-latex-packages-alist '(("" "minted")))
(setq org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
      '(("frame" "leftline")
        ("framesep" "2mm")))

(after! ess
  (setq ess-style 'RStudio
        ess-eval-visibly 'nowait
        ess-use-flymake nil)  ; Use flycheck instead

  ;; Enable rainbow delimiters in R scripts
  (add-hook! 'ess-r-mode-hook #'rainbow-delimiters-mode)

  ;; Enable line numbers in R scripts
  (add-hook! 'ess-r-mode-hook #'display-line-numbers-mode)

  ;; Auto-completion settings
  (setq ess-use-company t
        company-R-args t
        company-R-objects t))

(after! lsp-mode
  (setq lsp-r-server-path "R"
        lsp-r-lsp-server 'languageserver))

(define-derived-mode astro-mode web-mode "astro")
(setq auto-mode-alist
      (append '((".*\\.astro\\'" . astro-mode))
              auto-mode-alist))

(with-eval-after-load 'lsp-mode
  (add-to-list 'lsp-language-id-configuration
               '(astro-mode . "astro"))

  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("astro-ls" "--stdio"))
                    :activation-fn (lsp-activate-on "astro")
                    :server-id 'astro-ls)))

(after! org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((typescript . t))))

;(use-package! ob-typescript
;  :after org
;  :config
;  ;; Use tsx instead of ts-node
;  (setq org-babel-typescript-command "tsx"))

(org-babel-do-load-languages 'org-babel-load-languages '((csharp . t)))

(after! fsharp-mode
  (setq fsharp-ac-use-popup nil)  ; Use display-buffer instead of pop-up
  (setq lsp-fsharp-server-runtime 'net-core)  ; Use .NET Core runtime

  ;; Optional: Configure formatting
  (setq-hook! 'fsharp-mode-hook
    tab-width 4
    indent-tabs-mode nil))

;; Optional: Add key bindings
(map! :map fsharp-mode-map
      :localleader
      "b" #'fsharp-load-buffer-file    ; Load current buffer
      "e" #'fsharp-eval-region         ; Evaluate region
      "i" #'fsharp-ac-load-project     ; Load project
      "p" #'fsharp-ac-start-process)   ; Start F# process

(after! yasnippet
  (setq yas-snippet-dirs '("~/.doom.d/snippets")))

(add-to-list 'auto-mode-alist '("\\.pl$" . prolog-mode))
(setq prolog-electric-if-then-else-flag t)

; Org-Babel Support
(setq org-babel-prolog-command "swipl")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((prolog . t)))
